routes_p = [
    "ฐานโต๊ะเซน → ข้ามถนนหน้าวิศวะ → ฐานจามวิทยา",
    "ฐานจามวิทยา → ข้ามถนน → ฐานหอฬ.หน้า",
    "ฐานหอฬ.หน้า → ฐานหอฬ.หลัง",
    "ฐานหอฬ.หลัง → ข้ามถนน → เข้าหน้าคณะ → ขึ้นบันไดกลาง → ชั้น 3 → ฐานห้อง 319",
    "ฐานห้อง 319 → ขึ้นบันได318 → ชั้น 4 → ฐานห้อง 419",
    "ฐานห้อง 419 → ลงบันไดกลาง → ชั้น 1 → หน้าหอประชุม → ทางเดินหน้าคณะ → ฐานโต๊ะเซน",
]

routes_r = [
    "ฐานมหาหน้า → ทางเดินริมถนนฝั่งตรงข้ามคณะ → ฐานมหาหลัง",
    "ฐานมหาหลัง → ข้ามถนน → ฐานสระน้ำ",
    "ฐานสระน้ำ → ถนนหลัง Icanteen → ฐานตึก100-อังรี",
    "ฐานตึก100-อังรี → ถนนหน้าตึก 100 → กิจนิสิต → ขี้นบันไดกิจนิสิต → ชั้น 4 → ฐานห้อง 402",
    "ฐานห้อง 402 → ฐานห้อง 404",
    "ฐานห้อง 404 → ลงบันไดกลาง → ชั้น 1 → หน้าหอประชุม → ข้ามถนนหน้าคณะ → ฐานมหาหน้า",
]

routes_b = [
    "ลาดตึก4 → ทางเดินหน้าตึกโย → เลี้ยวขวาสุดมุมคณะ → ฐานโต๊ะไฟ",
    "ฐานโต๊ะไฟ → ข้ามถนน → ฐานจักเดิน",
    "ฐานจักรเดิน → ทางเดินฝั่งวิทยา → ตึกจักรพงษ์ → ข้ามถนน → ฐานรวมใจ",
    "ฐานรวมใจ → เข้าทางอเมซอน → ขึ้นบันไดซีรอก → ชั้น 3 → ฐานห้อง 320",
    "ฐานห้อง 320 → ออกทางขวา → ขึ้นบันไดริม → ชั้น 4 → ฐานห้อง 420",
    "ฐานห้อง 420 → ออกทางซ้าย → ลงบันไดซีรอก → ชั้น 1 → ออกประตูละหมาด",
]

baan_p = ["G", "H", "K", "T", "R", "S"]  # 319 419
baan_r = ["F", "Dog", "C", "J", "P", "B"]  # 402 404
baan_b = ["M", "A", "N", "E", "L", "Q"]  # 320 420


def sub_create(routes, baan, loop):
    output = []
    state = routes[loop % 6 :] + routes[: loop % 6]
    for index in range(6):
        output.append(f"บ้าน {baan[index]}: {state[index]}")
    return output


def create_route(loops=5):
    file = open("treasure.txt", "w")
    result = []

    for loop in range(loops):
        # baan 1
        pool1 = sub_create(routes_p, baan_p, loop)

        # baan 2
        pool2 = sub_create(routes_r, baan_r, loop)

        # baan 3
        pool3 = sub_create(routes_b, baan_b, loop)

        all_pool = sorted(pool1 + pool2 + pool3)

        result.append(all_pool)

        for i in all_pool:
            file.write(i + "\n")
        file.write("---------------- \n")
    file.close()


create_route()
